{"beliefs":{"student_knowledge":{"Árbol de búsqueda binaria (BST)":{"comprension":0.9,"precision":1.0,"profundidad":0.6},"Inserción en BST":{"comprension":0.9,"precision":1.0,"profundidad":0.6},"Eliminación en BST":{"comprension":0.9,"precision":1.0,"profundidad":0.6},"Búsqueda en BST":{"comprension":0.9,"precision":1.0,"profundidad":0.6},"Recorrido recursivo":{"comprension":0.6,"precision":0.9,"profundidad":0.6},"Encontrar el mínimo en un subárbol":{"comprension":0.9,"precision":1.0,"profundidad":0.6}},"learning_preferences":["Aprendizaje mediante implementación práctica"],"misconceptions":[]},"desires":{"primary_goal":"Al finalizar la sesión, el estudiante podrá implementar un árbol binario de búsqueda (ABB) para almacenar y recuperar datos, resolviendo al menos 3 ejercicios de diferente complejidad con una eficiencia del 80%.","secondary_goals":["El estudiante podrá explicar los conceptos de nodo, raíz, hoja, subárbol, recorrido en un ABB.","El estudiante podrá analizar la eficiencia de las operaciones básicas de un ABB (inserción, búsqueda, eliminación) en diferentes escenarios.","El estudiante podrá comparar y contrastar un ABB con otras estructuras de datos, como listas enlazadas y arrays, identificando sus ventajas y desventajas."],"success_criteria":{"comprension":0.8,"precision":0.9,"profundidad":0.7}},"intentions":{"action_plan":["Explicar el concepto de Árbol Binario de Búsqueda (ABB) y sus propiedades, utilizando ejemplos visuales y diagramas.","Implementar conjuntamente un ABB básico, incluyendo la inserción de nodos. Se resolverá un ejercicio sencillo de inserción.","Implementar la búsqueda de nodos en un ABB. Se resolverán dos ejercicios de búsqueda, uno sencillo y otro de complejidad media.","Implementar la eliminación de nodos en un ABB, cubriendo los tres casos posibles (nodo hoja, nodo con un hijo, nodo con dos hijos). Se resolverá un ejercicio de eliminación de complejidad media.","Resolver tres ejercicios de diferente complejidad que abarquen la inserción, búsqueda y eliminación en un ABB. Se revisará el código de cada ejercicio para asegurar la comprensión y eficiencia."],"current_step":0,"fallback_strategy":"provide_more_examples"}}