{"beliefs":{"student_knowledge":{"Árbol Binario de Búsqueda (ABB)":{"comprension":0.95,"precision":0.95,"profundidad":0.75},"Inserción en ABB":{"comprension":0.95,"precision":0.95,"profundidad":0.75},"Búsqueda en ABB":{"comprension":0.95,"precision":0.95,"profundidad":0.75},"Eliminación en ABB (incluye casos con un hijo o dos hijos)":{"comprension":0.95,"precision":0.95,"profundidad":0.75},"Recorrido en orden (inorder traversal)":{"comprension":0.95,"precision":0.95,"profundidad":0.75},"Recursividad":{"comprension":0.75,"precision":0.95,"profundidad":0.75}},"learning_preferences":["Aprendizaje mediante implementación de código"],"misconceptions":[]},"desires":{"primary_goal":"Al finalizar la sesión, el estudiante podrá implementar un árbol binario de búsqueda para almacenar y recuperar datos, resolviendo al menos 3 ejercicios de complejidad media.","secondary_goals":["El estudiante podrá definir y explicar los conceptos clave de un árbol binario de búsqueda, como nodo, raíz, subárbol, hoja, recorrido.","El estudiante podrá analizar la eficiencia de un árbol binario de búsqueda en términos de tiempo de búsqueda, inserción y eliminación.","El estudiante podrá identificar y corregir errores comunes en la implementación de un árbol binario de búsqueda."],"success_criteria":{"comprension":0.8,"precision":0.9,"profundidad":0.7}},"intentions":{"action_plan":["\"\"Explicación teórica de árboles binarios de búsqueda: concepto, propiedades, operaciones básicas (inserción, búsqueda, eliminación).\"\"","\"\"Resolver ejercicios de complejidad baja para practicar la inserción y búsqueda en árboles binarios de búsqueda.  Se proporcionará retroalimentación inmediata.\"\"","\"\"Explicación de la eliminación en árboles binarios de búsqueda, incluyendo los tres casos (nodo hoja, nodo con un hijo, nodo con dos hijos).\"\"","\"\"Resolver ejercicios de complejidad media: Se presentarán 3 ejercicios que requieran la implementación completa de las operaciones básicas en árboles binarios de búsqueda. Se dará tiempo para resolverlos individualmente y se revisarán las soluciones en conjunto, explicando diferentes enfoques.\"\"","\"\"Revisión final y preguntas: Se revisarán las dudas restantes y se proporcionará material adicional para reforzar el aprendizaje.\"\""],"current_step":0,"fallback_strategy":"provide_more_examples"}}