{"beliefs":{"student_knowledge":{"Árbol Binario de Búsqueda (ABB)":{"comprension":0.85,"precision":0.85,"profundidad":0.75},"Inserción en ABB":{"comprension":0.85,"precision":0.85,"profundidad":0.75},"Búsqueda en ABB":{"comprension":0.85,"precision":0.85,"profundidad":0.75},"Estructura de Conjuntos Disjuntos (Union-Find)":{"comprension":0.85,"precision":0.85,"profundidad":0.75},"Operación find() en Union-Find":{"comprension":0.85,"precision":0.85,"profundidad":0.75},"Operación union() en Union-Find":{"comprension":0.85,"precision":0.85,"profundidad":0.75},"Diferencias entre ABB y Union-Find":{"comprension":0.85,"precision":0.85,"profundidad":0.75}},"learning_preferences":[],"misconceptions":[]},"desires":{"primary_goal":"El estudiante comprenderá los conceptos fundamentales de la Teoría de Conjuntos Disjuntos y será capaz de implementar algoritmos básicos relacionados.","secondary_goals":["El estudiante podrá explicar el funcionamiento de la estructura de datos Union-Find.","El estudiante podrá implementar el algoritmo Union-Find para resolver problemas de conectividad.","El estudiante podrá analizar la complejidad temporal y espacial del algoritmo Union-Find."],"success_criteria":{"comprension":0.8,"precision":0.7,"profundidad":0.6}},"intentions":{"action_plan":["\"\"Introducción a la Teoría de Conjuntos: Definiciones básicas (conjuntos, subconjuntos, unión, intersección, diferencia).  Se presentarán ejemplos sencillos y visuales.\"\"","\"\"Conjuntos Disjuntos: Definición formal y ejemplos. Se enfatizará la condición de no tener elementos en común.\"\"","\"\"Algoritmos básicos con conjuntos disjuntos:  Se presentarán algoritmos simples para comprobar si dos conjuntos son disjuntos y para realizar operaciones básicas con ellos.  Se usarán ejemplos numéricos y con elementos concretos.\"\"","\"\"Representación gráfica de conjuntos disjuntos: Diagramas de Venn. Se trabajará con ejemplos concretos para visualizar la disyunción.\"\"","\"\"Ejercicios prácticos: Se propondrán ejercicios de diversa dificultad para afianzar los conceptos y la aplicación de los algoritmos. Se proporcionará retroalimentación inmediata.\"\""],"current_step":0,"fallback_strategy":"provide_more_examples"}}