{"beliefs":{"student_knowledge":{"Algoritmo de Dijkstra":{"comprension":0.8,"precision":0.9,"profundidad":0.7}},"learning_preferences":[],"misconceptions":[]},"desires":{"primary_goal":"Al finalizar el módulo, los estudiantes serán capaces de explicar el concepto de 'single source shortest path' (SSSP), describir al menos dos algoritmos para resolverlo (Dijkstra y Bellman-Ford), aplicarlos correctamente a grafos dirigidos y no dirigidos con pesos positivos y no negativos, e identificar las diferencias en su eficiencia y aplicabilidad, demostrándolo a través de la resolución de problemas prácticos y la implementación de al menos uno de los algoritmos en un lenguaje de programación.","secondary_goals":["Los estudiantes serán capaces de identificar diferentes representaciones de grafos (matrices de adyacencia, listas de adyacencia) y seleccionar la más apropiada para la implementación de los algoritmos SSSP.","Los estudiantes podrán analizar la complejidad temporal y espacial de los algoritmos Dijkstra y Bellman-Ford.","Los estudiantes podrán aplicar sus conocimientos de SSSP para resolver problemas del mundo real, como encontrar la ruta más corta en un mapa o la conexión más eficiente en una red."],"success_criteria":{}},"intentions":{"action_plan":[{"step":1,"title":"Introducción al problema SSSP y representación de grafos","activities":["Definición formal del problema 'Single Source Shortest Path' (SSSP).","Repaso de conceptos básicos de teoría de grafos: grafos dirigidos y no dirigidos, vértices, aristas, pesos.","Representación de grafos mediante matrices de adyacencia y listas de adyacencia.  Discusión de las ventajas y desventajas de cada representación.","Ejemplos de problemas del mundo real que se pueden modelar como problemas SSSP (ej. rutas de navegación, redes de computadoras)."],"assessment":"Ejercicios de representación de grafos y traducción de problemas del mundo real a grafos."},{"step":2,"title":"Algoritmo de Dijkstra","activities":["Explicación paso a paso del algoritmo de Dijkstra con ejemplos visuales.","Implementación del algoritmo de Dijkstra en pseudocódigo y un lenguaje de programación (Python recomendado).","Análisis de la complejidad temporal del algoritmo de Dijkstra (O(E log V)).","Ejercicios de aplicación del algoritmo de Dijkstra a grafos dirigidos y no dirigidos con pesos positivos."],"assessment":"Resolver problemas de SSSP utilizando el algoritmo de Dijkstra, tanto manualmente como mediante código.  Incluir análisis de la eficiencia."},{"step":3,"title":"Algoritmo de Bellman-Ford","activities":["Explicación paso a paso del algoritmo de Bellman-Ford con ejemplos visuales.","Implementación del algoritmo de Bellman-Ford en pseudocódigo y un lenguaje de programación (Python recomendado).","Análisis de la complejidad temporal del algoritmo de Bellman-Ford (O(VE)).","Ejercicios de aplicación del algoritmo de Bellman-Ford a grafos dirigidos con pesos positivos y negativos (detectando ciclos negativos)."],"assessment":"Resolver problemas de SSSP utilizando el algoritmo de Bellman-Ford, tanto manualmente como mediante código.  Incluir análisis de la eficiencia y detección de ciclos negativos."},{"step":4,"title":"Comparación de Dijkstra y Bellman-Ford","activities":["Comparación de la eficiencia y aplicabilidad de los algoritmos de Dijkstra y Bellman-Ford.","Discusión de las limitaciones de cada algoritmo (Dijkstra no funciona con pesos negativos, Bellman-Ford es menos eficiente para grafos con pesos positivos).","Ejercicios que requieren la selección del algoritmo más adecuado para un problema dado."],"assessment":"Preguntas de selección múltiple y problemas de aplicación que exigen justificar la elección del algoritmo."},{"step":5,"title":"Problemas de aplicación y proyectos","activities":["Resolver problemas de SSSP más complejos y realistas.","Proyecto final: implementación de uno de los algoritmos para resolver un problema del mundo real (ej. encontrar la ruta más corta en un mapa)."],"assessment":"Evaluación del proyecto final y resolución de problemas desafiantes."}],"current_step":0,"fallback_strategy":"provide_more_examples"}}